import Foundation

class Settings {
    static let shared = Settings()
    
    /// Стартовый уровень
    var startLevel = 1
}

/// Количество целей уровня
var levelsGoals: [Int: Int] = [
    1: 2,
    2: 2,
    3: 3,
    4: 3,
    5: 3,
    6: 3,
    7: 3,
    8: 3,
    9: 4,
    10: 4,
    11: 4,
    12: 4,
]

/// Количество айтемов в цели
var levelsItems: [Int: [Int]] = [
    1: [20, 20],
    2: [30, 30],
    3: [40, 40, 25],
    4: [40, 50, 30],
    5: [50, 55, 30],
    6: [50, 55, 35],
    7: [15, 20, 10],
    8: [60, 65, 45],
    9: [50, 40, 30, 20],
    10: [40, 45, 35, 25],
    11: [45, 50, 40, 30],
    12: [25, 30, 60, 30],
]

/// Время на уровне (в секундах)
var levelsTimers: [Int: [Double]] = [
    1: [35, 35],
    2: [60, 60],
    3: [75, 75, 35],
    4: [80, 80, 45],
    5: [95, 100, 45],
    6: [70, 75, 45],
    7: [50, 60, 50],
    8: [110, 120, 80],
    9: [70, 60, 40, 30],
    10: [80, 100, 70, 60],
    11: [100, 90, 80, 60],
    12: [50, 60, 140, 60],
]

/// Количество типов айтемов на уровнях
let levelsTypesItems: [Int: Int] = [
    1: 5,
    2: 5,
    3: 4,
    4: 5,
    5: 5,
    6: 4,
    7: 2,
    8: 5,
    9: 3,
    10: 5,
    11: 5,
    12: 5,
]
